'''
В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко;D, G – 2 очка;B, C, M, P – 3 очка;
F, H, V, W, Y – 4 очка;K – 5 очков;J, X – 8 очков;Q, Z – 10 очков.А русские буквы оцениваются так:А, В, Е, И, Н, О, Р, С, Т – 1 очко;
Д, К, Л, М, П, У – 2 очка;Б, Г, Ё, Ь, Я – 3 очка;Й, Ы – 4 очка;Ж, З, Х, Ц, Ч – 5 очков;Ш, Э, Ю – 8 очков;Ф, Щ, Ъ – 10 очков.
'''

dict = {}

dict[("A", "E", "I", "O", "U", "L", "N", "S", "T", "R")] = 1
dict[("D", "G")] = 2
dict[("B", "C", "M", "P")] = 3
dict[("F", "H", "V", "W", "Y")] = 4
dict[("K")] = 5
dict[("J", "X")] = 8
dict[("Q", "Z")] = 10

dict[("А", "В", "Е", "И", "Н", "О", "Р", "С", "Т")] = 1
dict[("Д", "К", "Л", "М", "П", "У")] = 2
dict[("Б", "Г", "Ё", "Ь", "Я")] = 3
dict[("Й", "Ы")] = 4
dict[("Ж", "З", "Х", "Ц", "Ч")] = 5
dict[("Ш", "Э", "Ю")] = 8
dict[("Ф", "Щ", "Ъ")] = 8

word = str(input("Введите слово: ")).upper()
result = 0
for i in word:
    for j in dict:
        if i in j:
            result += dict.get(j)

print(result)
