# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку разобраться в его кричалках не настолько просто,
#   насколько легко он их придумывает, Вам стоит написать программу.
#   Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
#   Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами.
#   Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”,
#   если с ритмом все не в порядке
#
# *Пример:*
#
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
#     **Вывод:** Парам пам-пам

vowel = ['а', 'e', 'о', 'ы', 'и', 'э', 'я', 'ю', 'ё', 'е']
song = str(input())
print(song)


def winnie(song):
    words = song.split(" ")
    for i in range(len(words)-1):
        courent_word_len = len(list(filter(lambda x: x in vowel, words[i])))
        next_word_len = len(list(filter(lambda x: x in vowel, words[i+1])))
        if courent_word_len != next_word_len:
            return "Пам парам"

    return "Парам пам-пам"


print(winnie(song))
